/*
 * @version: no version
 * @LastEditors: qingmeijiupiao
 * @Description: 达妙电机寄存器
 * @author: qingmeijiupiao
 * @LastEditTime: 2025-01-20 20:58:34
 */
#ifndef DMRegister_HPP
#define DMRegister_HPP
//DM寄存器
enum DMRegisterAddress {
    UV_Value = 0x00,  // 低压保护值
    KT_Value = 0x01,  // 扭矩系数
    OT_Value = 0x02,  // 过温保护值
    OC_Value = 0x03,  // 过流保护值
    ACCE = 0x04,       // 加速度
    DECE = 0x05,       // 减速度
    MAX_SPD = 0x06,   // 最大速度
    MST_ID = 0x07,    // 反馈 ID
    ESC_ID = 0x08,    // 接收 ID
    TIMEOUT = 0x09,   // 超时警报时间
    CTRL_MODE = 0x0A, // 控制模式
    Damp = 0x0B,      // 电机粘滞系数
    Inertia = 0x0C,   // 电机转动惯量
    hw_ver = 0x0D,    // 硬件版本号
    sw_ver = 0x0E,    // 软件版本号
    SN = 0x0F,        // 序列号
    NPP = 0x10,       // 电机极对数
    Rs = 0x11,        // 电机相电阻
    Ls = 0x12,        // 电机相电感
    Flux = 0x13,      // 电机磁链值
    Gr = 0x14,        // 齿轮减速比
    PMAX = 0x15,      // 位置映射范围
    VMAX = 0x16,      // 速度映射范围
    TMAX = 0x17,      // 扭矩映射范围
    I_BW = 0x18,      // 电流环控制带宽
    KP_ASR = 0x19,    // 速度环 Kp
    KI_ASR = 0x1A,    // 速度环 Ki
    OV_Value = 0x1D,  // 过压保护值
    GREF = 0x1E,      // 齿轮力矩效率
    Deta = 0x1F,      // 速度环阻尼系数
    V_BW = 0x20,      // 速度环滤波带宽
    IQ_c1 = 0x21,     // 电流环增强系数
    VL_c1 = 0x22,     // 速度环增强系数
    can_br = 0x23,    // CAN 波特率代码
    sub_ver = 0x24,   // 子版本号
    u_off = 0x32,     // u 相偏置
    v_off = 0x33,     // v 相偏置
    k1 = 0x34,        // 补偿因子 1
    k2 = 0x35,        // 补偿因子 2
    m_off = 0x36,     // 角度偏移
    dir = 0x37,       // 方向
    p_m = 0x50,       // 电机当前位置
    xout = 0x51,      // 输出轴位置
};
struct DMRegisterData_t {
    float UV_Value;      // 低压保护值
    float KT_Value;      // 扭矩系数
    float OT_Value;      // 过温保护值
    float OC_Value;      // 过流保护值
    float Acceleration;  // 加速度
    float Deceleration;  // 减速度
    float MaxSpeed;      // 最大速度
    uint32_t MST_ID;     // 反馈 ID
    uint32_t ESC_ID;     // 接收 ID
    uint32_t Timeout;    // 超时警报时间
    uint32_t ControlMode; // 控制模式
    float DampingCoefficient; // 电机粘滞系数
    float MomentOfInertia;   // 电机转动惯量
    uint32_t HardwareVersion; // 硬件版本号
    uint32_t SoftwareVersion; // 软件版本号
    uint32_t SerialNumber;     // 序列号
    uint32_t NumberPolePairs; // 电机极对数
    float PhaseResistance;    // 电机相电阻
    float PhaseInductance;    // 电机相电感
    float FluxLinkage;        // 电机磁链值
    float GearReduction;      // 齿轮减速比
    float PositionMapRange;   // 位置映射范围
    float SpeedMapRange;      // 速度映射范围
    float TorqueMapRange;     // 扭矩映射范围
    float CurrentLoopBandwidth;// 电流环控制带宽
    float SpeedLoopProportionalGain; // 速度环 Kp
    float SpeedLoopIntegralGain;    // 速度环 Ki
    float OV_Value;            // 过压保护值
    float GearTorqueEfficiency;    // 齿轮力矩效率
    float SpeedLoopDampingCoefficient; // 速度环阻尼系数
    float SpeedLoopFilterBandwidth; // 速度环滤波带宽
    float CurrentLoopCompensationFactor; // 电流环增强系数
    float SpeedLoopCompensationFactor;  // 速度环增强系数
    uint32_t CAN_BaudrateCode; // CAN 波特率代码
    uint32_t SubVersion;       // 子版本号
    float UPhaseOffset;        // U 相偏置
    float VPhaseOffset;        // V 相偏置
    float CompensationFactor1; // 补偿因子 1
    float CompensationFactor2; // 补偿因子 2
    float AngleOffset;         // 角度偏移
    float Direction;           // 方向
    float MotorCurrentPosition; // 电机当前位置
    float OutputShaftPosition;  // 输出轴位置
};
#endif
/*
                                              .=%@#=.                                               
                                            -*@@@@@@@#=.                                            
                                         .+%@@@@@@@@@@@@#=                                          
                                       -#@@@@@@@* =@@@@@@@@*:                                       
                                     =%@@@@@@@@=   -@@@@@@@@@#-                                     
                                  .+@@@@@@@@@@-     .@@@@@@@@@@%=                                   
                                .+@@@@@@@@@@@@-     +@@@@@@@@@@@@@+.                                
                               +@@@@@@@@@@@@@@@    .@@@@@@@@@@@@@@@@+.                              
                             =@@@@@@@@@@@@@@@%-     =%@@%@@@@@@@@@@@@@=                             
                           -%@@@@@@@@@@@@+..     .       -@@@@@@@@@@@@@%-                           
                         .#@@@@@@@@@@@@@#       -@+       +@@@@@@@@@@@@@@#:                         
                        +@@@@@@@@@@@@@@@@+     +@@@+     =@@@@@@@@@@@@@@@@@+                        
                      :%@@@@@@@@@@@@@@@@@+    *@@@@*     =@@@@@@@@@@@@@@@@@@%-                      
                     +@@@@@@@@@@@@@@#+*+-   .#@@@@+       :+*+*@@@@@@@@@@@@@@@*                     
                   :%@@@@@@@@@@@@@@+       :%@@@@-    .-       -@@@@@@@@@@@@@@@%:                   
                  =@@@@@@@@@@@@@@@@-      -@@@@%:    .%@+      =@@@@@@@@@@@@@@@@@=                  
                 *@@@@@@@@@@@@@@@@@@.    =@@@@#.    -@@@@+    =@@@@@@@@@@@@@@@@@@@#                 
               .%@@@@@@@@@@@@@@@@@@+    +@@@@*     =@@@@%:    .#@@@@@@@@@@@@@@@@@@@%.               
              :@@@@@@@@@@@@@@@%:::.    #@@@@+     +@@@@#        .::.*@@@@@@@@@@@@@@@@-              
             -@@@@@@@@@@@@@@@%       .%@@@@=     *@@@@*     +-       *@@@@@@@@@@@@@@@@=             
            =@@@@@@@@@@@@@@@@@#.    -@@@@@-    :%@@@@=    .#@@+     +@@@@@@@@@@@@@@@@@@=            
           =@@@@@@@@@@@@@@@@@@@:    =====.     -+===:     :====     @@@@@@@@@@@@@@@@@@@@+           
          +@@@@@@@@@@@@@@@#%%#-                                     :*%%#%@@@@@@@@@@@@@@@+          
         =@@@@@@@@@@@@@@%.       ...........................              *@@@@@@@@@@@@@@@=         
        =@@@@@@@@@@@@@@@+      .#@@@@@@@@@@@@@@@@@@@@@@@@@@#     .*:      =@@@@@@@@@@@@@@@@-        
       -@@@@@@@@@@@@@@@@@=    .%@@@@@@@@@@@@@@@@@@@@@@@@@@#     :@@@-    =@@@@@@@@@@@@@@@@@@:       
      :@@@@@@@@@@@@@@@@@%.   -@@@@%+=====================:     -@@@@%    :%@@@@@@@@@@@@@@@@@@.      
      %@@@@@@@@@@@@@=-=:    =@@@@#.                           +@@@@#.      -=--%@@@@@@@@@@@@@%      
     #@@@@@@@@@@@@@:       +@@@@*      ............. .       *@@@@*             %@@@@@@@@@@@@@+     
    =@@@@@@@@@@@@@@#.     #@@@@+     +@@@@@@@@@@@@@@@#.    .#@@@@+     +#.     +@@@@@@@@@@@@@@@:    
   .@@@@@@@@@@@@@@@@-   .%@@@@=     *@@@@@@@@@@@@@@@#     :%@@@@-     *@@%:    @@@@@@@@@@@@@@@@%    
   %@@@@@@@@@@@%%%#=   :@@@@@:    .#@@@@+-----------     -@@@@@:     #@@@@=    :#%%%@@@@@@@@@@@@*   
  =@@@@@@@@@@@=       -@@@@%.    :%@@@@-                =@@@@%.    .%@@@@=          :%@@@@@@@@@@@:  
  @@@@@@@@@@@%.      =@@@@#     -@@@@%:    .:::-:      +@@@@#     :@@@@@:    .       +@@@@@@@@@@@#  
 +@@@@@@@@@@@@@.    *@@@@*     =@@@@#.    -@@@@@:     #@@@@+     =@@@@%.    -@#     +@@@@@@@@@@@@@- 
.@@@@@@@@@@@@@#    *@%@%=     +@@@@*     =@@@@#.    .#@@@%=     +@@@@#     =@@@%.   =@@@@@@@@@@@@@% 
+@@@@@@@@*-==-                .          .           . ..       .....      .....     .=+=+@@@@@@@@@-
%@@@@@@@+                                                                                 -@@@@@@@@#
@@@@@@@-       =#%#=     -#%%#-     -#%%*.     +%%%*.    .*%%#=     :#%%#-     =%%%*.      .#@@@@@@@
@@@@@@=.::::::*@@@@@*:::-@@@@@@-:::=@@@@@%::::*@@@@@#::::%@@@@@+:---@@@@@@=---+@@@@@%------:=@@@@@@@
=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+
 *@@@@@@@@@@@@@@@@@@@@@@@@@@@%%##**++===----:::::------===++***##%%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@* 
  -#@@@@@@@@@@@@@@@@%#*+=-:.                                        ..::-=+*##%@@@@@@@@@@@@@@@@@#-  
    :=*%@@@@@%#*=-:                                                             .:-=+*#%%%%##+-.    
                                                                                        
        K####      #####     ###    ###  ######.   ##########     K##    ### ###    ##W    ####W    
       #######    #######    ###    ###  ########  ##########     ###    ### ###   ###   W######    
      W###G####  ###W ####   ###    ###  ######### ##########     ###    ###  ##   ###   ###W####   
      ###   ###  ###   ###   ###    ##  ###    ###    ###         ###    ###  ### t##   ###   ###   
     G##    #   ###    ###   ##     ##  ###    ###    ###         ###    ###  ### ###   ##W         
     ###        ###    ###   ##    ###  ###    ###    ###         ##L    ##   ### ##   ###          
     ###        ###    ###  K##    ###  ###    ###    ###         ##     ##    #####   ###          
     ###       ,##     ###  ###    ###  ###   ###,    ##         G##    ###    ####    ###          
    W##        ###     ###  ###    ###  #########     ##         ##########    ####    ###          
    ###        ###     ###  ###    ###  ########     ###         ##########    ###i   K##           
    ###        ###     ###  ###    ##  #######       ###         ###    ###    ####   ###           
    ###        ###     ###  ##     ##  ###           ###         ###    ###   ##W##   ###           
    ###        ###     ##i  ##    ###  ###           ###         ###    ##    ## ##   ###           
    ###        ###    ###  ,##    ###  ###           ###         ##     ##   ### ##   ###           
    ###    ### ###    ###  K##    ###  ###           ##         t##    ###   ##  ###  ###    ###    
    ###   G##i ###   ###   .##   ###.  ##t           ##         ###    ###  ###  ###  W##,   ###    
     ########  W##W#####    ########   ##           ###         ###    ###  ##    ##   ####W###     
     #######    #######     #######   ###           ###         ###    ### ###    ##.  #######      
      #####      #####       #####    ###           ###         ###    ### ##W    ###   #####       
                   ###                                                                              
                   ###                                                                              
                   #####                                                                            
                    ####                                                                            
                      K                                                                             
*/