/*
 * @LastEditors: qingmeijiupiao
 * @Description: HXC战队nvs储存系统二次封装库，用于储存变量到NVS
 * @Author: qingmeijiupiao
 * @LastEditTime: 2024-12-09 23:33:26
 */
#ifndef HXC_NVS_HPP
#define HXC_NVS_HPP
#include "Arduino.h"
#include "nvs.h"
#include "nvs_flash.h"

//使用HXC命名空间
namespace HXC{


//错误代码对应的错误信息数组
static const char * nvs_errors[] = { "OTHER", "NOT_INITIALIZED", "NOT_FOUND", "TYPE_MISMATCH", "READ_ONLY", "NOT_ENOUGH_SPACE", "INVALID_NAME", "INVALID_HANDLE", "REMOVE_FAILED", "KEY_TOO_LONG", "PAGE_FULL", "INVALID_STATE", "INVALID_LENGTH"};

// 用于将NVS的错误代码转换为对应的错误信息的宏
#define nvs_error(e) (((e)>ESP_ERR_NVS_BASE)?nvs_errors[(e)&~(ESP_ERR_NVS_BASE)]:nvs_errors[0])

//默认使用的NVS page名称
#define NVS_NAME "HXC_ESPNOW"

template<typename Value_type>
class NVS_DATA{
public:
    // 构造函数，初始化key和默认值
    NVS_DATA(String _key,Value_type default_value){
        if(_key.length()>15){
            log_e("nvs key too long: %s", key.c_str());
            _key=_key.substring(0,15);
        }
        this->key=_key;
        this->value=default_value;
    }
    ~NVS_DATA(){}
    // 保存数据到NVS的方法
    esp_err_t save(){
        if(!is_setup){setup();} // 如果未初始化，则先初始化

        esp_err_t err = nvs_set_blob(_handle, key.c_str(), (const void*)&value, sizeof(Value_type)); // 将数据写入NVS
        if(err){
            log_e("nvs_set_blob fail: %s %s", key.c_str(), nvs_error(err)); // 如果写入失败，记录错误信息
        }
        err = nvs_commit(_handle); // 提交写入操作
        if(err){
            log_e("nvs_commit fail: %s %s", key.c_str(), nvs_error(err)); // 如果提交失败，记录错误信息
        }
        return err; // 返回操作结果
    }

    // 从NVS读取数据的方法
    Value_type read(){
        if(!is_setup){setup();} // 如果未初始化，则先初始化
        if(is_read) return value; // 如果已经读取过，则直接返回缓存的值
        size_t datalen = 0;
        esp_err_t err = nvs_get_blob(_handle, key.c_str(), NULL, &datalen); // 获取数据长度
        if(err!=ESP_OK || datalen!=sizeof(Value_type)){
            log_e("nvs_get_blob len fail: %s %s", key, nvs_error(err)); // 如果获取长度失败，记录错误信息
            return value; // 返回默认值
        }
        err = nvs_get_blob(_handle, key.c_str(), (void*)&value, &datalen); // 读取数据
        if(err){
            log_e("nvs_get_blob fail: %s %s", key.c_str(), nvs_error(err)); // 如果读取失败，记录错误信息
            return value; // 返回默认值
        }
        is_read=true; // 标记为已读取
        return value; // 返回读取的值
    }

    // 重载赋值运算符，用于更新NVS中的数据
    NVS_DATA& operator=(const Value_type& newValue) {
        value = newValue;
        save(); // 保存到NVS
        return *this;
    }

    // 重载隐式类型转换运算符，用于获取NVS中的数据
    operator Value_type() {
        return read(); // 读取NVS中的值
    }

protected:
    // 静态方法，用于初始化NVS
    static void setup(){
        if(is_setup) return; // 如果已经初始化，则直接返回
        auto err= nvs_open(NVS_NAME,NVS_READWRITE, &_handle); // 打开NVS命名空间
        if(err!=ESP_OK){
            log_e("nvs_open failed: %s", nvs_error(err)); // 如果打开失败，记录错误信息
            return;
        };
        is_setup=true; // 标记为已初始化
    }
    String key; // 存储NVS中的key
    static uint32_t _handle; // 存储NVS的句柄
    static bool is_setup; // 标记是否已经初始化
    bool is_read=false; // 标记是否已经读取过数据
    Value_type value; // 存储数据的值
};
// 初始化类的静态成员变量
template<typename Value_type>
bool NVS_DATA<Value_type>::is_setup=false;

template<typename Value_type>
uint32_t NVS_DATA<Value_type>::_handle=0;

}
#endif
/*
                                              .=%@#=.                                               
                                            -*@@@@@@@#=.                                            
                                         .+%@@@@@@@@@@@@#=                                          
                                       -#@@@@@@@* =@@@@@@@@*:                                       
                                     =%@@@@@@@@=   -@@@@@@@@@#-                                     
                                  .+@@@@@@@@@@-     .@@@@@@@@@@%=                                   
                                .+@@@@@@@@@@@@-     +@@@@@@@@@@@@@+.                                
                               +@@@@@@@@@@@@@@@    .@@@@@@@@@@@@@@@@+.                              
                             =@@@@@@@@@@@@@@@%-     =%@@%@@@@@@@@@@@@@=                             
                           -%@@@@@@@@@@@@+..     .       -@@@@@@@@@@@@@%-                           
                         .#@@@@@@@@@@@@@#       -@+       +@@@@@@@@@@@@@@#:                         
                        +@@@@@@@@@@@@@@@@+     +@@@+     =@@@@@@@@@@@@@@@@@+                        
                      :%@@@@@@@@@@@@@@@@@+    *@@@@*     =@@@@@@@@@@@@@@@@@@%-                      
                     +@@@@@@@@@@@@@@#+*+-   .#@@@@+       :+*+*@@@@@@@@@@@@@@@*                     
                   :%@@@@@@@@@@@@@@+       :%@@@@-    .-       -@@@@@@@@@@@@@@@%:                   
                  =@@@@@@@@@@@@@@@@-      -@@@@%:    .%@+      =@@@@@@@@@@@@@@@@@=                  
                 *@@@@@@@@@@@@@@@@@@.    =@@@@#.    -@@@@+    =@@@@@@@@@@@@@@@@@@@#                 
               .%@@@@@@@@@@@@@@@@@@+    +@@@@*     =@@@@%:    .#@@@@@@@@@@@@@@@@@@@%.               
              :@@@@@@@@@@@@@@@%:::.    #@@@@+     +@@@@#        .::.*@@@@@@@@@@@@@@@@-              
             -@@@@@@@@@@@@@@@%       .%@@@@=     *@@@@*     +-       *@@@@@@@@@@@@@@@@=             
            =@@@@@@@@@@@@@@@@@#.    -@@@@@-    :%@@@@=    .#@@+     +@@@@@@@@@@@@@@@@@@=            
           =@@@@@@@@@@@@@@@@@@@:    =====.     -+===:     :====     @@@@@@@@@@@@@@@@@@@@+           
          +@@@@@@@@@@@@@@@#%%#-                                     :*%%#%@@@@@@@@@@@@@@@+          
         =@@@@@@@@@@@@@@%.       ...........................              *@@@@@@@@@@@@@@@=         
        =@@@@@@@@@@@@@@@+      .#@@@@@@@@@@@@@@@@@@@@@@@@@@#     .*:      =@@@@@@@@@@@@@@@@-        
       -@@@@@@@@@@@@@@@@@=    .%@@@@@@@@@@@@@@@@@@@@@@@@@@#     :@@@-    =@@@@@@@@@@@@@@@@@@:       
      :@@@@@@@@@@@@@@@@@%.   -@@@@%+=====================:     -@@@@%    :%@@@@@@@@@@@@@@@@@@.      
      %@@@@@@@@@@@@@=-=:    =@@@@#.                           +@@@@#.      -=--%@@@@@@@@@@@@@%      
     #@@@@@@@@@@@@@:       +@@@@*      ............. .       *@@@@*             %@@@@@@@@@@@@@+     
    =@@@@@@@@@@@@@@#.     #@@@@+     +@@@@@@@@@@@@@@@#.    .#@@@@+     +#.     +@@@@@@@@@@@@@@@:    
   .@@@@@@@@@@@@@@@@-   .%@@@@=     *@@@@@@@@@@@@@@@#     :%@@@@-     *@@%:    @@@@@@@@@@@@@@@@%    
   %@@@@@@@@@@@%%%#=   :@@@@@:    .#@@@@+-----------     -@@@@@:     #@@@@=    :#%%%@@@@@@@@@@@@*   
  =@@@@@@@@@@@=       -@@@@%.    :%@@@@-                =@@@@%.    .%@@@@=          :%@@@@@@@@@@@:  
  @@@@@@@@@@@%.      =@@@@#     -@@@@%:    .:::-:      +@@@@#     :@@@@@:    .       +@@@@@@@@@@@#  
 +@@@@@@@@@@@@@.    *@@@@*     =@@@@#.    -@@@@@:     #@@@@+     =@@@@%.    -@#     +@@@@@@@@@@@@@- 
.@@@@@@@@@@@@@#    *@%@%=     +@@@@*     =@@@@#.    .#@@@%=     +@@@@#     =@@@%.   =@@@@@@@@@@@@@% 
+@@@@@@@@*-==-                .          .           . ..       .....      .....     .=+=+@@@@@@@@@-
%@@@@@@@+                                                                                 -@@@@@@@@#
@@@@@@@-       =#%#=     -#%%#-     -#%%*.     +%%%*.    .*%%#=     :#%%#-     =%%%*.      .#@@@@@@@
@@@@@@=.::::::*@@@@@*:::-@@@@@@-:::=@@@@@%::::*@@@@@#::::%@@@@@+:---@@@@@@=---+@@@@@%------:=@@@@@@@
=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+
 *@@@@@@@@@@@@@@@@@@@@@@@@@@@%%##**++===----:::::------===++***##%%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@* 
  -#@@@@@@@@@@@@@@@@%#*+=-:.                                        ..::-=+*##%@@@@@@@@@@@@@@@@@#-  
    :=*%@@@@@%#*=-:                                                             .:-=+*#%%%%##+-.    
                                                                                        
        K####      #####     ###    ###  ######.   ##########     K##    ### ###    ##W    ####W    
       #######    #######    ###    ###  ########  ##########     ###    ### ###   ###   W######    
      W###G####  ###W ####   ###    ###  ######### ##########     ###    ###  ##   ###   ###W####   
      ###   ###  ###   ###   ###    ##  ###    ###    ###         ###    ###  ### t##   ###   ###   
     G##    #   ###    ###   ##     ##  ###    ###    ###         ###    ###  ### ###   ##W         
     ###        ###    ###   ##    ###  ###    ###    ###         ##L    ##   ### ##   ###          
     ###        ###    ###  K##    ###  ###    ###    ###         ##     ##    #####   ###          
     ###       ,##     ###  ###    ###  ###   ###,    ##         G##    ###    ####    ###          
    W##        ###     ###  ###    ###  #########     ##         ##########    ####    ###          
    ###        ###     ###  ###    ###  ########     ###         ##########    ###i   K##           
    ###        ###     ###  ###    ##  #######       ###         ###    ###    ####   ###           
    ###        ###     ###  ##     ##  ###           ###         ###    ###   ##W##   ###           
    ###        ###     ##i  ##    ###  ###           ###         ###    ##    ## ##   ###           
    ###        ###    ###  ,##    ###  ###           ###         ##     ##   ### ##   ###           
    ###    ### ###    ###  K##    ###  ###           ##         t##    ###   ##  ###  ###    ###    
    ###   G##i ###   ###   .##   ###.  ##t           ##         ###    ###  ###  ###  W##,   ###    
     ########  W##W#####    ########   ##           ###         ###    ###  ##    ##   ####W###     
     #######    #######     #######   ###           ###         ###    ### ###    ##.  #######      
      #####      #####       #####    ###           ###         ###    ### ##W    ###   #####       
                   ###                                                                              
                   ###                                                                              
                   #####                                                                            
                    ####                                                                            
                      K                                                                             
*/